system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.001;

writeControl    adjustableRunTime; //adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable off;

adjustTimeStep  off; //off, no

maxCo           1;
maxAlphaCo      1;
maxDeltaT       1;
wallShearStress1
{
    // Mandatory entries (unmodifiable)
    type        wallShearStress;
    libs        (fieldFunctionObjects);

    // Optional entries (runtime modifiable)
    patches     ("concretewall" "pipe2" "caja" "disipador");   
    // Optional (inherited) entries
}


// ************************************************************************* //
