constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       711035;
    }
    outlet
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          376;
        startFace       711095;
    }
    pipe1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4526;
        startFace       711471;
    }
    pipe2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          13588;
        startFace       715997;
    }
    concreteWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          46315;
        startFace       729585;
    }
    atmosphere
    {
        type            patch;
        inGroups        List<word> 1(wall);
        nFaces          6480;
        startFace       775900;
    }
    disipador
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          34635;
        startFace       782380;
    }
)

// ************************************************************************* //
