0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
   /* inlet
    {
        type            fixedValue;
        value			uniform (0 0 -1.75);
    }*/
    
    inlet
   {
    type				flowRateInletVelocity;
    volumetricFlowRate				1E-04; //Qd=0.004m3/s
    extrapolateProfile  yes;
    value				uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    concreteWall
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }
    pipe1
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }
    pipe2
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }
    disipador
    {
        type            fixedValue;
        value                   uniform (0 0 0);
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
