0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.0233E-06;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    concreteWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    pipe1
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    pipe2
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    disipador
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    atmosphere //".*"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
