system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("caja.stl" "inlet.stl" "outlet.stl" "pipe1.stl" "pipe2.stl" "concreteWall.stl" "atmosphere.stl" "disipador.stl");

// Identify a feature when angle between faces < includedAngle
includedAngle   150; //30

// ************************************************************************* //
